BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
/*
 * STM32 NUCLEO-G474RE bare-metal TLC59711 optical/OD calibration + tracking.
 *
 * Host commands over USART2 / ST-LINK VCP at 921600 baud:
 *   RESET_CALIBRATE     reset measurement state, calibrate all pairs, track
 *   REUSE_CALIBRATION   restart tracking from pair 0 with RAM calibration
 *   LOADZERO            clear host-restored calibration rows
 *   LOADROW,i,duty,ref_centi
 *                       restore one calibration row from host CSV
 *   STATUS              print calibration state
 *   BOARD_RESET         call NVIC_SystemReset()
 *
 * Pins:
 *   USART2 TX/RX: PA2/PA3, reserved for ST-LINK virtual COM port
 *   TLC59711 clock: PB6
 *   TLC59711 data:  Arduino D9 = PC7
 */

#include "stm32g474xx.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define SYSCLK_HZ 16000000UL
#define UART_BAUD 115200UL

#define NUM_CHANNELS 24U
#define NUM_TLC_BOARDS 2U
#define TLC_OUTPUTS_PER_BOARD 12U
#define NUM_TLC_OUTPUTS (NUM_TLC_BOARDS * TLC_OUTPUTS_PER_BOARD)
#define TLC_OUTPUT_DISABLED 0xFFU
#define ADC_SAMPLES 32U
#define CALIBRATION_REPEATS 5U
#define TRACKING_REPEATS 8U
#define MAX_MEASUREMENT_REPEATS TRACKING_REPEATS
#define BETWEEN_ADC_US 200U

#define PWM_MAX 65535U
#define CALIBRATION_DUTY_STEP 512U
#define MAX_SWEEP_POINTS ((PWM_MAX / CALIBRATION_DUTY_STEP) + 3U)

#define ADC_LIMIT 4090.0f
#define TRACKING_FRACTION_OF_MAX 0.80f
#define MIN_TRACKING_FRACTION_OF_MAX 0.70f
#define TRACKING_FRACTION_STEP 0.05f
#define PWM_NOISE_MIN_DROP_ADC 40.0f
#define PWM_NOISE_MIN_DROP_FRACTION 0.02f
#define PWM_NOISE_DUTY_GUARD (CALIBRATION_DUTY_STEP * 2U)

#define MIN_LINEAR_POINTS 6
#define MIN_LINEAR_R_SQUARED 0.995f
#define MAX_LINEAR_RESIDUAL_FRACTION 0.06f
#define MIN_EDGE_SLOPE_RATIO 0.45f

#define LED_SETTLE_MS 12U
#define TRACKING_LED_ON_BEFORE_MEASURE_MS 1000U
#define TRACKING_LED_ON_AFTER_MEASURE_MS 1000U
#define CALIBRATION_PWM_SETTLE_MS 50U
#define CALIBRATION_AFTER_MEASURE_MS 20U
#define BETWEEN_REPEAT_MS 4U
#define BETWEEN_LED_MS 8U
#define BETWEEN_TRACKING_CYCLES_MS 120000U

#define TLC_CLOCK_PORT GPIOB
#define TLC_CLOCK_PIN 6U
#define TLC_DATA_PORT GPIOC
#define TLC_DATA_PIN 7U

#define AHT_SDA_PORT GPIOB
#define AHT_SDA_PIN 8U
#define AHT_SCL_PORT GPIOB
#define AHT_SCL_PIN 9U
#define AHT_I2C_ADDRESS 0x38U
#define AHT_I2C_DELAY_US 5U

typedef enum {
  ACTION_NONE = 0,
  ACTION_CALIBRATE,
  ACTION_REUSE_CALIBRATION,
} RequestedAction;

typedef struct {
  ADC_TypeDef *adc;
  uint8_t channel;
  bool enabled;
} AdcInput;

typedef struct {
  int start_index;
  int end_index;
  float slope;
  float intercept;
  float r_squared;
  float residual_fraction;
  bool valid;
  bool fallback_used;
} LinearRangeFit;

typedef struct {
  uint16_t peak_duty;
  float peak_adc;
  uint16_t linear_start_duty;
  uint16_t linear_end_duty;
  float linear_start_adc;
  float linear_end_adc;
  float fit_slope;
  float fit_intercept;
  float fit_r_squared;
  float target_adc;
  uint16_t tracking_duty;
  float tracking_reference_adc;
  int sweep_points;
  bool limit_reached;
  bool fallback_fit;
} CalibrationResult;

static const AdcInput adc_inputs[NUM_CHANNELS] = {
    {ADC1, 14, true},   /* ch0  PB11 ADC1_IN14 */
    {ADC1, 11, true},   /* ch1  PB12 ADC1_IN11 */
    {ADC1, 8, true},    /* ch2  PC2  ADC1_IN8 */
    {ADC1, 9, true},    /* ch3  PC3  ADC1_IN9 */
    {ADC2, 11, true},   /* ch4  PC5  ADC2_IN11 */
    {ADC2, 4, true},    /* ch5  PA7  ADC2_IN4 */
    {ADC2, 15, true},   /* ch6  PB15 ADC2_IN15 */
    {ADC1, 5, true},    /* ch7  PB14 ADC1_IN5 */
    {ADC5, 2, true},    /* ch8  PA9  ADC5_IN2 */
    {ADC5, 1, true},    /* ch9  PA8  ADC5_IN1 */
    {ADC2, 12, true},   /* ch10 PB2  ADC2_IN12 */
    {ADC1, 12, true},   /* ch11 PB1  ADC1_IN12 */
    {ADC2, 5, true},    /* ch12 PC4  ADC2_IN5 */
    {ADC3, 5, true},    /* ch13 PB13 ADC3_IN5 */
    {ADC1, 7, true},    /* ch14 PC1  ADC1_IN7 */
    {ADC1, 6, true},    /* ch15 PC0  ADC1_IN6 */
    {ADC2, 3, true},    /* ch16 PA6  ADC2_IN3 */
    {ADC2, 13, true},   /* ch17 PA5  ADC2_IN13 */
    {ADC2, 17, true},   /* ch18 PA4  ADC2_IN17 */
    {ADC1, 15, true},   /* ch19 PB0  ADC1_IN15 */
    {NULL, 0, false},   /* ch20 off, no ADC */
    {NULL, 0, false},   /* ch21 off, no ADC */
    {ADC1, 1, true},    /* ch22 PA0  ADC1_IN1 */
    {ADC1, 2, true},    /* ch23 PA1  ADC1_IN2 */
};

static const char *channel_columns[NUM_CHANNELS] = {
    "ch0_pb11",
    "ch1_pb12",
    "ch2_pc2",
    "ch3_pc3",
    "ch4_pc5",
    "ch5_pa7",
    "ch6_pb15",
    "ch7_pb14",
    "ch8_pa9",
    "ch9_pa8",
    "ch10_pb2",
    "ch11_pb1",
    "ch12_pc4",
    "ch13_pb13",
    "ch14_pc1",
    "ch15_pc0",
    "ch16_pa6",
    "ch17_pa5",
    "ch18_pa4",
    "ch19_pb0",
    "ch20_off",
    "ch21_off",
    "ch22_pa0",
    "ch23_pa1",
};

/*
 * TLC channel order follows the Adafruit TLC59711 convention:
 *   0=R0, 1=G0, 2=B0, 3=R1, 4=G1, 5=B1,
 *   6=R2, 7=G2, 8=B2, 9=R3, 10=G3, 11=B3.
 */
static const uint8_t tlc_output_for_pair[NUM_CHANNELS] = {
    8,                   /* pair 0:  PB11 with board 1 G1 */
    9,                   /* pair 1:  PB12 with board 1 B1 */
    3,                   /* pair 2:  PC2  with board 2 G0 */
    2,                   /* pair 3:  PC3  with board 2 R0 */
    4,                   /* pair 4:  PC5  with board 1 B0 */
    5,                   /* pair 5:  PA7  with board 1 R1 */
    7,                   /* pair 6:  PB15 with board 2 R1 */
    6,                   /* pair 7:  PB14 with board 2 B0 */
    0,                   /* pair 8:  PA9  with board 1 R0 */
    1,                   /* pair 9:  PA8  with board 1 G0 */
    11,                  /* pair 10: PB2  with board 2 B1 */
    10,                  /* pair 11: PB1  with board 2 G1 */
    20,                  /* pair 12: PC4  with board 1 R2 */
    21,                  /* pair 13: PB13 with board 1 G2 */
    22,                  /* pair 14: PC1  with board 2 G3 */
    23,                  /* pair 15: PC0  with board 2 B3 */
    16,                  /* pair 16: PA6  with board 1 B2 */
    17,                  /* pair 17: PA5  with board 1 R3 */
    18,                  /* pair 18: PA4  with board 2 B2 */
    19,                  /* pair 19: PB0  with board 2 R3 */
    12,                  /* pair 20: no ADC with board 1 G3, skipped in measurement */
    13,                  /* pair 21: no ADC with board 1 B3, skipped in measurement */
    14,                  /* pair 22: PA0  with board 2 R2 */
    15,                  /* pair 23: PA1  with board 2 G2 */
};

static const uint8_t tlc_logical_output_for_board_channel[NUM_TLC_BOARDS][TLC_OUTPUTS_PER_BOARD] = {
    {0, 1, 4, 5, 8, 9, 12, 13, 16, 17, 20, 21},      /* board 1 */
    {2, 3, 6, 7, 10, 11, 14, 15, 18, 19, 22, 23},    /* board 2 */
};

static uint16_t tlc_pwm[NUM_TLC_OUTPUTS];
static CalibrationResult calibration[NUM_CHANNELS];
static bool calibration_valid = false;
static uint32_t calibration_loaded_mask = 0U;
static volatile uint32_t system_millis = 0;
static RequestedAction requested_action = ACTION_NONE;
static char command_buffer[64];
static uint32_t command_length = 0;

