BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
void SysTick_Handler(void) {
  system_millis++;
}

static uint32_t millis(void) {
  return system_millis;
}

static void delay_us(uint32_t us) {
  const uint32_t cycles = (SYSCLK_HZ / 1000000UL) * us;
  const uint32_t start = DWT->CYCCNT;
  while ((DWT->CYCCNT - start) < cycles) {
  }
}

static void delay_ms(uint32_t ms) {
  const uint32_t start = millis();
  while ((millis() - start) < ms) {
  }
}

static void dwt_init(void) {
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CYCCNT = 0;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static void clock_init_hsi16(void) {
  RCC->CR |= RCC_CR_HSION;
  while ((RCC->CR & RCC_CR_HSIRDY) == 0U) {
  }

  FLASH->ACR = (FLASH->ACR & ~FLASH_ACR_LATENCY) |
               FLASH_ACR_LATENCY_0WS |
               FLASH_ACR_PRFTEN |
               FLASH_ACR_ICEN |
               FLASH_ACR_DCEN;

  RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_SW | RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2)) |
              RCC_CFGR_SW_HSI |
              RCC_CFGR_HPRE_DIV1 |
              RCC_CFGR_PPRE1_DIV1 |
              RCC_CFGR_PPRE2_DIV1;
  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI) {
  }
}

static void gpio_set_mode(GPIO_TypeDef *gpio, uint32_t pin, uint32_t mode) {
  gpio->MODER = (gpio->MODER & ~(0x3UL << (pin * 2U))) |
                (mode << (pin * 2U));
}

static void gpio_set_af(GPIO_TypeDef *gpio, uint32_t pin, uint32_t af) {
  const uint32_t index = pin >> 3U;
  const uint32_t shift = (pin & 0x7U) * 4U;
  gpio->AFR[index] = (gpio->AFR[index] & ~(0xFUL << shift)) |
                     (af << shift);
}

static void gpio_make_output(GPIO_TypeDef *gpio, uint32_t pin) {
  gpio_set_mode(gpio, pin, 0x1UL);
  gpio->OTYPER &= ~(1UL << pin);
  gpio->PUPDR &= ~(0x3UL << (pin * 2U));
  gpio->OSPEEDR |= (0x3UL << (pin * 2U));
}

static void gpio_make_open_drain_output(GPIO_TypeDef *gpio, uint32_t pin) {
  gpio_set_mode(gpio, pin, 0x1UL);
  gpio->OTYPER |= (1UL << pin);
  gpio->PUPDR &= ~(0x3UL << (pin * 2U));
  gpio->OSPEEDR |= (0x3UL << (pin * 2U));
}

static void gpio_make_input(GPIO_TypeDef *gpio, uint32_t pin) {
  gpio_set_mode(gpio, pin, 0x0UL);
  gpio->PUPDR &= ~(0x3UL << (pin * 2U));
}

static void gpio_make_analog_adc(GPIO_TypeDef *gpio, uint32_t pin) {
  gpio_set_mode(gpio, pin, 0x3UL);
  gpio->PUPDR &= ~(0x3UL << (pin * 2U));
}

static void gpio_init(void) {
  RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN |
                  RCC_AHB2ENR_GPIOBEN |
                  RCC_AHB2ENR_GPIOCEN;
  (void)RCC->AHB2ENR;

  gpio_set_mode(GPIOA, 2U, 0x2UL);
  gpio_set_mode(GPIOA, 3U, 0x2UL);
  gpio_set_af(GPIOA, 2U, 7U);
  gpio_set_af(GPIOA, 3U, 7U);
  GPIOA->OSPEEDR |= (0x3UL << (2U * 2U)) | (0x3UL << (3U * 2U));
  GPIOA->PUPDR &= ~((0x3UL << (2U * 2U)) | (0x3UL << (3U * 2U)));

  gpio_make_output(TLC_CLOCK_PORT, TLC_CLOCK_PIN);
  gpio_make_output(TLC_DATA_PORT, TLC_DATA_PIN);
  gpio_make_input(AHT_SDA_PORT, AHT_SDA_PIN);
  gpio_make_input(AHT_SCL_PORT, AHT_SCL_PIN);

  gpio_make_analog_adc(GPIOA, 0U);
  gpio_make_analog_adc(GPIOA, 1U);
  gpio_make_analog_adc(GPIOA, 4U);
  gpio_make_analog_adc(GPIOA, 5U);
  gpio_make_analog_adc(GPIOA, 6U);
  gpio_make_analog_adc(GPIOA, 7U);
  gpio_make_analog_adc(GPIOA, 8U);
  gpio_make_analog_adc(GPIOA, 9U);
  gpio_make_analog_adc(GPIOB, 0U);
  gpio_make_analog_adc(GPIOB, 1U);
  gpio_make_analog_adc(GPIOB, 2U);
  gpio_make_analog_adc(GPIOB, 11U);
  gpio_make_analog_adc(GPIOB, 12U);
  gpio_make_analog_adc(GPIOB, 13U);
  gpio_make_analog_adc(GPIOB, 14U);
  gpio_make_analog_adc(GPIOB, 15U);
  gpio_make_analog_adc(GPIOC, 0U);
  gpio_make_analog_adc(GPIOC, 1U);
  gpio_make_analog_adc(GPIOC, 2U);
  gpio_make_analog_adc(GPIOC, 3U);
  gpio_make_analog_adc(GPIOC, 4U);
  gpio_make_analog_adc(GPIOC, 5U);
}

static void usart2_init(void) {
  RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;
  (void)RCC->APB1ENR1;

  USART2->CR1 = 0U;
  USART2->BRR = (SYSCLK_HZ + (UART_BAUD / 2UL)) / UART_BAUD;
  USART2->CR1 = USART_CR1_TE | USART_CR1_RE | USART_CR1_UE;
}

static void uart_write_char(char c) {
#ifdef USART_ISR_TXE_TXFNF
  while ((USART2->ISR & USART_ISR_TXE_TXFNF) == 0U) {
  }
#else
  while ((USART2->ISR & USART_ISR_TXE) == 0U) {
  }
#endif
  USART2->TDR = (uint32_t)(uint8_t)c;
}

static bool uart_read_char(char *out) {
#ifdef USART_ISR_RXNE_RXFNE
  if ((USART2->ISR & USART_ISR_RXNE_RXFNE) == 0U) {
    return false;
  }
#else
  if ((USART2->ISR & USART_ISR_RXNE) == 0U) {
    return false;
  }
#endif

  *out = (char)(USART2->RDR & 0xFFU);
  return true;
}

static void uart_write_str(const char *s) {
  while (*s != '\0') {
    uart_write_char(*s++);
  }
}

static void uart_write_u32(uint32_t value) {
  char buffer[10];
  uint32_t index = 0U;

  if (value == 0U) {
    uart_write_char('0');
    return;
  }

  while (value > 0U && index < sizeof(buffer)) {
    buffer[index++] = (char)('0' + (value % 10U));
    value /= 10U;
  }

  while (index > 0U) {
    uart_write_char(buffer[--index]);
  }
}

static void uart_write_float(float value, uint8_t decimals) {
  if (isnan(value)) {
    uart_write_str("nan");
    return;
  }

  if (value < 0.0f) {
    uart_write_char('-');
    value = -value;
  }

  uint32_t scale = 1U;
  for (uint8_t i = 0U; i < decimals; i++) {
    scale *= 10U;
  }

  uint32_t integer = (uint32_t)value;
  float fractional_value = (value - (float)integer) * (float)scale;
  uint32_t fractional = (uint32_t)(fractional_value + 0.5f);
  if (fractional >= scale) {
    integer++;
    fractional -= scale;
  }

  uart_write_u32(integer);
  if (decimals == 0U) {
    return;
  }

  uart_write_char('.');
  uint32_t divisor = scale / 10U;
  while (divisor > 0U) {
    uart_write_char((char)('0' + ((fractional / divisor) % 10U)));
    divisor /= 10U;
  }
}

static void aht_sda_low(void) {
  AHT_SDA_PORT->BSRR = (1UL << (AHT_SDA_PIN + 16U));
  gpio_make_open_drain_output(AHT_SDA_PORT, AHT_SDA_PIN);
}

static void aht_sda_release(void) {
  gpio_make_input(AHT_SDA_PORT, AHT_SDA_PIN);
}

static bool aht_sda_read(void) {
  return (AHT_SDA_PORT->IDR & (1UL << AHT_SDA_PIN)) != 0U;
}

static void aht_scl_low(void) {
  AHT_SCL_PORT->BSRR = (1UL << (AHT_SCL_PIN + 16U));
  gpio_make_open_drain_output(AHT_SCL_PORT, AHT_SCL_PIN);
}

static void aht_scl_release(void) {
  gpio_make_input(AHT_SCL_PORT, AHT_SCL_PIN);
}

