BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
static void aht_i2c_delay(void) {
  delay_us(AHT_I2C_DELAY_US);
}

static void aht_i2c_start(void) {
  aht_sda_release();
  aht_scl_release();
  aht_i2c_delay();
  aht_sda_low();
  aht_i2c_delay();
  aht_scl_low();
}

static void aht_i2c_stop(void) {
  aht_sda_low();
  aht_i2c_delay();
  aht_scl_release();
  aht_i2c_delay();
  aht_sda_release();
  aht_i2c_delay();
}

static bool aht_i2c_write_byte(uint8_t value) {
  for (int32_t bit = 7; bit >= 0; bit--) {
    if (((uint32_t)value & (1UL << (uint32_t)bit)) != 0U) {
      aht_sda_release();
    } else {
      aht_sda_low();
    }

    aht_i2c_delay();
    aht_scl_release();
    aht_i2c_delay();
    aht_scl_low();
  }

  aht_sda_release();
  aht_i2c_delay();
  aht_scl_release();
  aht_i2c_delay();
  const bool ack = !aht_sda_read();
  aht_scl_low();
  return ack;
}

static uint8_t aht_i2c_read_byte(bool ack) {
  uint8_t value = 0U;

  aht_sda_release();
  for (int32_t bit = 7; bit >= 0; bit--) {
    aht_i2c_delay();
    aht_scl_release();
    aht_i2c_delay();
    if (aht_sda_read()) {
      value |= (uint8_t)(1U << (uint32_t)bit);
    }
    aht_scl_low();
  }

  if (ack) {
    aht_sda_low();
  } else {
    aht_sda_release();
  }

  aht_i2c_delay();
  aht_scl_release();
  aht_i2c_delay();
  aht_scl_low();
  aht_sda_release();
  return value;
}

static bool aht_write_command(uint8_t command, uint8_t arg0, uint8_t arg1) {
  aht_i2c_start();
  bool ok = aht_i2c_write_byte((uint8_t)(AHT_I2C_ADDRESS << 1U));
  ok = aht_i2c_write_byte(command) && ok;
  ok = aht_i2c_write_byte(arg0) && ok;
  ok = aht_i2c_write_byte(arg1) && ok;
  aht_i2c_stop();
  return ok;
}

static bool aht_read_bytes(uint8_t data[6]) {
  aht_i2c_start();
  bool ok = aht_i2c_write_byte((uint8_t)((AHT_I2C_ADDRESS << 1U) | 1U));
  for (uint32_t i = 0U; i < 6U; i++) {
    data[i] = aht_i2c_read_byte(i + 1U < 6U);
  }
  aht_i2c_stop();
  return ok;
}

static void aht_init(void) {
  aht_sda_release();
  aht_scl_release();
  delay_ms(40U);
  (void)aht_write_command(0xBEU, 0x08U, 0x00U);
  delay_ms(10U);
}

static bool aht_read(float *temperature_c, float *humidity_percent) {
  uint8_t data[6] = {0U};

  if (!aht_write_command(0xACU, 0x33U, 0x00U)) {
    return false;
  }

  delay_ms(80U);

  if (!aht_read_bytes(data) || (data[0] & 0x80U) != 0U) {
    return false;
  }

  const uint32_t humidity_raw =
      ((uint32_t)data[1] << 12U) |
      ((uint32_t)data[2] << 4U) |
      ((uint32_t)data[3] >> 4U);
  const uint32_t temperature_raw =
      (((uint32_t)data[3] & 0x0FU) << 16U) |
      ((uint32_t)data[4] << 8U) |
      (uint32_t)data[5];

  *humidity_percent = ((float)humidity_raw * 100.0f) / 1048576.0f;
  *temperature_c = (((float)temperature_raw * 200.0f) / 1048576.0f) - 50.0f;
  return true;
}

static void adc_set_sample_time(ADC_TypeDef *adc, uint8_t channel) {
  const uint32_t sample_time = 6U; /* 247.5 ADC cycles */

  if (channel <= 9U) {
    const uint32_t shift = (uint32_t)channel * 3U;
    adc->SMPR1 = (adc->SMPR1 & ~(0x7UL << shift)) |
                 (sample_time << shift);
  } else {
    const uint32_t shift = ((uint32_t)channel - 10U) * 3U;
    adc->SMPR2 = (adc->SMPR2 & ~(0x7UL << shift)) |
                 (sample_time << shift);
  }
}

static void adc_enable_single_ended(ADC_TypeDef *adc) {
  if ((adc->CR & ADC_CR_ADEN) != 0U) {
    adc->CR |= ADC_CR_ADDIS;
    while ((adc->CR & ADC_CR_ADEN) != 0U) {
    }
  }

  adc->CR &= ~ADC_CR_DEEPPWD;
  adc->CR |= ADC_CR_ADVREGEN;
  delay_us(20U);

  adc->DIFSEL = 0U;
  adc->CFGR = 0U;
  adc->SMPR1 = 0U;
  adc->SMPR2 = 0U;

  for (uint32_t i = 0U; i < NUM_CHANNELS; i++) {
    if (adc_inputs[i].enabled && adc_inputs[i].adc == adc) {
      adc_set_sample_time(adc, adc_inputs[i].channel);
    }
  }

  adc->CR &= ~ADC_CR_ADCALDIF;
  adc->CR |= ADC_CR_ADCAL;
  while ((adc->CR & ADC_CR_ADCAL) != 0U) {
  }

  adc->ISR = ADC_ISR_ADRDY;
  adc->CR |= ADC_CR_ADEN;
  while ((adc->ISR & ADC_ISR_ADRDY) == 0U) {
  }
}

static void adc_init_all(void) {
  RCC->AHB2ENR |= RCC_AHB2ENR_ADC12EN | RCC_AHB2ENR_ADC345EN;
  (void)RCC->AHB2ENR;

  ADC12_COMMON->CCR = (ADC12_COMMON->CCR & ~ADC_CCR_CKMODE) |
                      ADC_CCR_CKMODE_0; /* HCLK / 1 = 16 MHz */
  ADC345_COMMON->CCR = (ADC345_COMMON->CCR & ~ADC_CCR_CKMODE) |
                       ADC_CCR_CKMODE_0; /* HCLK / 1 = 16 MHz */

  adc_enable_single_ended(ADC1);
  adc_enable_single_ended(ADC2);
  adc_enable_single_ended(ADC3);
  adc_enable_single_ended(ADC5);
}

static uint16_t adc_read_once(ADC_TypeDef *adc, uint8_t channel) {
  while ((adc->CR & ADC_CR_ADSTART) != 0U) {
  }

  adc->ISR = ADC_ISR_EOC | ADC_ISR_EOS | ADC_ISR_OVR;
  adc->SQR1 = ((uint32_t)channel << 6U);
  adc->CR |= ADC_CR_ADSTART;

  while ((adc->ISR & ADC_ISR_EOC) == 0U) {
  }

  return (uint16_t)(adc->DR & 0x0FFFU);
}

static uint16_t adc_read_average(uint32_t index) {
  uint32_t sum = 0U;
  const AdcInput *input = &adc_inputs[index];

  if (!input->enabled) {
    return 0U;
  }

  for (uint32_t i = 0U; i < ADC_SAMPLES; i++) {
    sum += adc_read_once(input->adc, input->channel);
    if (i + 1U < ADC_SAMPLES) {
      delay_us(BETWEEN_ADC_US);
    }
  }

  return (uint16_t)((sum + (ADC_SAMPLES / 2U)) / ADC_SAMPLES);
}

static void tlc_clock_low(void) {
  TLC_CLOCK_PORT->BSRR = (1UL << (TLC_CLOCK_PIN + 16U));
}

static void tlc_clock_high(void) {
  TLC_CLOCK_PORT->BSRR = (1UL << TLC_CLOCK_PIN);
}

static void tlc_data_low(void) {
  TLC_DATA_PORT->BSRR = (1UL << (TLC_DATA_PIN + 16U));
}

static void tlc_data_high(void) {
  TLC_DATA_PORT->BSRR = (1UL << TLC_DATA_PIN);
}

static void tlc_write_bit(uint32_t bit) {
  if (bit != 0U) {
    tlc_data_high();
  } else {
    tlc_data_low();
  }

  tlc_clock_high();
  tlc_clock_low();
}

static void tlc_write_u32(uint32_t value) {
  for (int32_t bit = 31; bit >= 0; bit--) {
    tlc_write_bit((value >> (uint32_t)bit) & 0x1UL);
  }
}

static void tlc_write_u16(uint16_t value) {
  for (int32_t bit = 15; bit >= 0; bit--) {
    tlc_write_bit(((uint32_t)value >> (uint32_t)bit) & 0x1UL);
  }
}

static void tlc_write(void) {
  const uint32_t write_command = 0x25UL;
  const uint32_t function_control = 0x16UL;
  const uint32_t brightness = 127UL;
  const uint32_t header = (write_command << 26U) |
                          (function_control << 21U) |
                          (brightness << 14U) |
                          (brightness << 7U) |
                          brightness;

