BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
  for (int32_t board = (int32_t)NUM_TLC_BOARDS - 1; board >= 0; board--) {
    tlc_write_u32(header);
    for (int32_t channel = (int32_t)TLC_OUTPUTS_PER_BOARD - 1; channel >= 0; channel--) {
      const uint8_t logical_output =
          tlc_logical_output_for_board_channel[board][channel];
      tlc_write_u16(tlc_pwm[logical_output]);
    }
  }

  delay_us(200U);
}

static void all_leds_off(void) {
  for (uint32_t i = 0U; i < NUM_TLC_OUTPUTS; i++) {
    tlc_pwm[i] = 0U;
  }
  tlc_write();
}

static void set_active_pair(uint8_t active_channel, uint16_t pwm) {
  for (uint32_t i = 0U; i < NUM_TLC_OUTPUTS; i++) {
    tlc_pwm[i] = 0U;
  }

  const uint8_t output = tlc_output_for_pair[active_channel];
  if (output != TLC_OUTPUT_DISABLED && output < NUM_TLC_OUTPUTS) {
    tlc_pwm[output] = pwm;
  }
  tlc_write();
}

static void poll_commands(void);

static void measure_pair_to_all_channels(
    uint8_t active_channel,
    uint16_t pwm,
    uint32_t repeats,
    float means[NUM_CHANNELS],
    uint16_t raw_samples[MAX_MEASUREMENT_REPEATS][NUM_CHANNELS]) {
  uint32_t sums[NUM_CHANNELS] = {0U};

  all_leds_off();
  delay_ms(BETWEEN_LED_MS);
  set_active_pair(active_channel, pwm);
  delay_ms(TRACKING_LED_ON_BEFORE_MEASURE_MS);

  for (uint32_t repeat = 0U; repeat < repeats; repeat++) {
    for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
      uint16_t reading = adc_read_average(ch);
      sums[ch] += reading;
      if (raw_samples != NULL && repeat < MAX_MEASUREMENT_REPEATS) {
        raw_samples[repeat][ch] = reading;
      }
    }

    poll_commands();
    if (repeat + 1U < repeats) {
      delay_ms(BETWEEN_REPEAT_MS);
    }
  }

  delay_ms(TRACKING_LED_ON_AFTER_MEASURE_MS);
  all_leds_off();
  delay_ms(BETWEEN_LED_MS);

  for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
    means[ch] = (float)sums[ch] / (float)repeats;
  }
}

static void measure_current_calibration_pwm_to_all_channels(
    uint32_t repeats,
    float means[NUM_CHANNELS]) {
  uint32_t sums[NUM_CHANNELS] = {0U};

  delay_ms(CALIBRATION_PWM_SETTLE_MS);

  for (uint32_t repeat = 0U; repeat < repeats; repeat++) {
    for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
      sums[ch] += adc_read_average(ch);
    }

    poll_commands();
    if (repeat + 1U < repeats) {
      delay_ms(BETWEEN_REPEAT_MS);
    }
  }

  delay_ms(CALIBRATION_AFTER_MEASURE_MS);

  for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
    means[ch] = (float)sums[ch] / (float)repeats;
  }
}

static void write_channel_floats(const float values[NUM_CHANNELS], uint8_t decimals) {
  for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
    uart_write_char(',');
    uart_write_float(values[ch], decimals);
  }
}

static void write_channel_raw(const uint16_t values[NUM_CHANNELS]) {
  for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
    uart_write_char(',');
    uart_write_u32(values[ch]);
  }
}

static void status(const char *message) {
  uart_write_str("STATUS: ");
  uart_write_str(message);
  uart_write_str("\r\n");
}

static void write_channel_column_names(void) {
  for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
    uart_write_char(',');
    uart_write_str(channel_columns[ch]);
  }
}

static void write_calibration_sweep_header(void) {
  uart_write_str("CSV,calibration_sweep.csv,");
  uart_write_str("led_index,duty,main_adc");
  write_channel_column_names();
  uart_write_str("\r\n");
}

static void write_calibration_summary_header(void) {
  uart_write_str("CSV,calibration_summary.csv,");
  uart_write_str("led_index,paired_diode,peak_duty,peak_adc,linear_start_duty,");
  uart_write_str("linear_end_duty,linear_start_adc,linear_end_adc,fit_slope,");
  uart_write_str("fit_intercept,fit_r_squared,target_adc,tracking_duty,");
  uart_write_str("tracking_reference_adc,limit_reached,fallback_fit,sweep_points\r\n");
}

static void write_tracking_header(void) {
  uart_write_str("CSV,tracking.csv,");
  uart_write_str("timestamp_ms,cycle,led_index,duty,reference_adc,main_adc,");
  uart_write_str("normalized,delta_od,temperature_c,humidity_percent");
  write_channel_column_names();
  uart_write_str("\r\n");
}

static void write_tracking_repeats_header(void) {
  uart_write_str("CSV,tracking_repeats.csv,");
  uart_write_str("timestamp_ms,cycle,led_index,duty,repeat");
  write_channel_column_names();
  uart_write_str("\r\n");
}

static void write_all_headers(void) {
  write_calibration_sweep_header();
  write_calibration_summary_header();
  write_tracking_header();
  write_tracking_repeats_header();
}

static void write_calibration_sweep_row(uint8_t active_channel, uint16_t duty,
                                        const float means[NUM_CHANNELS]) {
  uart_write_str("CSV,calibration_sweep.csv,");
  uart_write_u32(active_channel);
  uart_write_char(',');
  uart_write_u32(duty);
  uart_write_char(',');
  uart_write_float(means[active_channel], 2U);
  write_channel_floats(means, 2U);
  uart_write_str("\r\n");
}

static void write_calibration_summary_row(uint8_t active_channel,
                                          const CalibrationResult *result) {
  uart_write_str("CSV,calibration_summary.csv,");
  uart_write_u32(active_channel);
  uart_write_char(',');
  uart_write_u32(active_channel);
  uart_write_char(',');
  uart_write_u32(result->peak_duty);
  uart_write_char(',');
  uart_write_float(result->peak_adc, 2U);
  uart_write_char(',');
  uart_write_u32(result->linear_start_duty);
  uart_write_char(',');
  uart_write_u32(result->linear_end_duty);
  uart_write_char(',');
  uart_write_float(result->linear_start_adc, 2U);
  uart_write_char(',');
  uart_write_float(result->linear_end_adc, 2U);
  uart_write_char(',');
  uart_write_float(result->fit_slope, 6U);
  uart_write_char(',');
  uart_write_float(result->fit_intercept, 6U);
  uart_write_char(',');
  uart_write_float(result->fit_r_squared, 6U);
  uart_write_char(',');
  uart_write_float(result->target_adc, 2U);
  uart_write_char(',');
  uart_write_u32(result->tracking_duty);
  uart_write_char(',');
  uart_write_float(result->tracking_reference_adc, 2U);
  uart_write_char(',');
  uart_write_u32(result->limit_reached ? 1U : 0U);
  uart_write_char(',');
  uart_write_u32(result->fallback_fit ? 1U : 0U);
  uart_write_char(',');
  uart_write_u32((uint32_t)result->sweep_points);
  uart_write_str("\r\n");
}

static void write_tracking_repeats_row(uint32_t timestamp_ms, uint32_t cycle,
                                       uint8_t active_channel, uint16_t duty,
                                       uint32_t repeat,
                                       const uint16_t raw_values[NUM_CHANNELS]) {
  uart_write_str("CSV,tracking_repeats.csv,");
  uart_write_u32(timestamp_ms);
  uart_write_char(',');
  uart_write_u32(cycle);
  uart_write_char(',');
  uart_write_u32(active_channel);
  uart_write_char(',');
  uart_write_u32(duty);
  uart_write_char(',');
  uart_write_u32(repeat);
  write_channel_raw(raw_values);
  uart_write_str("\r\n");
}

static void write_tracking_row(uint32_t timestamp_ms, uint32_t cycle,
                               uint8_t active_channel,
                               const float means[NUM_CHANNELS],
                               float temperature_c,
                               float humidity_percent) {
  const float reference = calibration[active_channel].tracking_reference_adc;
  const float main_adc = means[active_channel];
  const float normalized = reference > 0.0f ? main_adc / reference : 0.0f;
  const float delta_od = normalized > 0.0f ? -log10f(normalized) : NAN;

  uart_write_str("CSV,tracking.csv,");
  uart_write_u32(timestamp_ms);
  uart_write_char(',');
  uart_write_u32(cycle);
  uart_write_char(',');
  uart_write_u32(active_channel);
  uart_write_char(',');
  uart_write_u32(calibration[active_channel].tracking_duty);
  uart_write_char(',');
  uart_write_float(reference, 2U);
  uart_write_char(',');
  uart_write_float(main_adc, 2U);
  uart_write_char(',');
  uart_write_float(normalized, 6U);
  uart_write_char(',');
  uart_write_float(delta_od, 6U);
  uart_write_char(',');
  uart_write_float(temperature_c, 2U);
  uart_write_char(',');
  uart_write_float(humidity_percent, 2U);
  write_channel_floats(means, 2U);
  uart_write_str("\r\n");
}

static bool is_better_linear_fit(const LinearRangeFit *candidate,
                                 const LinearRangeFit *current,
                                 const uint16_t sweep_duty[MAX_SWEEP_POINTS]) {
  if (!current->valid) {
    return true;
  }

  const int candidate_points = candidate->end_index - candidate->start_index + 1;
  const int current_points = current->end_index - current->start_index + 1;
  if (candidate_points != current_points) {
    return candidate_points > current_points;
  }

  const uint16_t candidate_span =
      sweep_duty[candidate->end_index] - sweep_duty[candidate->start_index];
  const uint16_t current_span =
      sweep_duty[current->end_index] - sweep_duty[current->start_index];
  if (candidate_span != current_span) {
    return candidate_span > current_span;
  }

