BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
  if (candidate->r_squared != current->r_squared) {
    return candidate->r_squared > current->r_squared;
  }

  return candidate->residual_fraction < current->residual_fraction;
}

static LinearRangeFit find_linear_range(const uint16_t sweep_duty[MAX_SWEEP_POINTS],
                                        const float sweep_main_adc[MAX_SWEEP_POINTS],
                                        int points) {
  float prefix_x[MAX_SWEEP_POINTS + 1U] = {0.0f};
  float prefix_y[MAX_SWEEP_POINTS + 1U] = {0.0f};
  float prefix_xx[MAX_SWEEP_POINTS + 1U] = {0.0f};
  float prefix_yy[MAX_SWEEP_POINTS + 1U] = {0.0f};
  float prefix_xy[MAX_SWEEP_POINTS + 1U] = {0.0f};

  for (int i = 0; i < points; i++) {
    const float x = (float)sweep_duty[i];
    const float y = sweep_main_adc[i];
    prefix_x[i + 1] = prefix_x[i] + x;
    prefix_y[i + 1] = prefix_y[i] + y;
    prefix_xx[i + 1] = prefix_xx[i] + (x * x);
    prefix_yy[i + 1] = prefix_yy[i] + (y * y);
    prefix_xy[i + 1] = prefix_xy[i] + (x * y);
  }

  LinearRangeFit best_valid = {0};
  LinearRangeFit best_fallback = {0};

  for (int start = 0; start <= points - MIN_LINEAR_POINTS; start++) {
    for (int end = start + MIN_LINEAR_POINTS - 1; end < points; end++) {
      const int count = end - start + 1;
      const float sum_x = prefix_x[end + 1] - prefix_x[start];
      const float sum_y = prefix_y[end + 1] - prefix_y[start];
      const float sum_xx = prefix_xx[end + 1] - prefix_xx[start];
      const float sum_yy = prefix_yy[end + 1] - prefix_yy[start];
      const float sum_xy = prefix_xy[end + 1] - prefix_xy[start];

      const float denominator = ((float)count * sum_xx) - (sum_x * sum_x);
      if (fabsf(denominator) < 1e-6f) {
        continue;
      }

      const float slope = (((float)count * sum_xy) - (sum_x * sum_y)) / denominator;
      if (slope <= 0.0f) {
        continue;
      }

      const float intercept = (sum_y - (slope * sum_x)) / (float)count;
      const float sse = sum_yy + (slope * slope * sum_xx) +
                        ((float)count * intercept * intercept) -
                        (2.0f * slope * sum_xy) -
                        (2.0f * intercept * sum_y) +
                        (2.0f * slope * intercept * sum_x);
      const float sst = sum_yy - ((sum_y * sum_y) / (float)count);
      const float r_squared = sst <= 1e-6f ? 1.0f : 1.0f - (fmaxf(sse, 0.0f) / sst);

      float min_adc = sweep_main_adc[start];
      float max_adc = sweep_main_adc[start];
      float max_residual = 0.0f;
      for (int i = start; i <= end; i++) {
        const float adc = sweep_main_adc[i];
        if (adc < min_adc) {
          min_adc = adc;
        }
        if (adc > max_adc) {
          max_adc = adc;
        }

        const float fit_adc = (slope * (float)sweep_duty[i]) + intercept;
        const float residual = fabsf(adc - fit_adc);
        if (residual > max_residual) {
          max_residual = residual;
        }
      }

      const float adc_span = max_adc - min_adc;
      if (adc_span <= 1.0f) {
        continue;
      }

      const float residual_fraction = max_residual / adc_span;
      const float first_slope =
          (sweep_main_adc[start + 1] - sweep_main_adc[start]) /
          (float)(sweep_duty[start + 1] - sweep_duty[start]);
      const float last_slope =
          (sweep_main_adc[end] - sweep_main_adc[end - 1]) /
          (float)(sweep_duty[end] - sweep_duty[end - 1]);

      LinearRangeFit candidate = {
          .start_index = start,
          .end_index = end,
          .slope = slope,
          .intercept = intercept,
          .r_squared = r_squared,
          .residual_fraction = residual_fraction,
          .valid = true,
          .fallback_used = false,
      };

      if (is_better_linear_fit(&candidate, &best_fallback, sweep_duty)) {
        best_fallback = candidate;
      }

      const bool matches_linear_shape =
          r_squared >= MIN_LINEAR_R_SQUARED &&
          residual_fraction <= MAX_LINEAR_RESIDUAL_FRACTION &&
          first_slope >= (slope * MIN_EDGE_SLOPE_RATIO) &&
          last_slope >= (slope * MIN_EDGE_SLOPE_RATIO);
      if (matches_linear_shape &&
          is_better_linear_fit(&candidate, &best_valid, sweep_duty)) {
        best_valid = candidate;
      }
    }
  }

  if (best_valid.valid) {
    return best_valid;
  }

  if (best_fallback.valid) {
    best_fallback.fallback_used = true;
    return best_fallback;
  }

  LinearRangeFit fallback = {0};
  fallback.start_index = 0;
  fallback.end_index = points - 1;
  fallback.valid = true;
  fallback.fallback_used = true;

  if (points >= 2) {
    const float delta_duty = (float)(sweep_duty[points - 1] - sweep_duty[0]);
    fallback.slope = delta_duty > 0.0f
                         ? (sweep_main_adc[points - 1] - sweep_main_adc[0]) / delta_duty
                         : 0.0f;
    fallback.intercept = sweep_main_adc[0] - (fallback.slope * (float)sweep_duty[0]);
  } else {
    fallback.slope = 0.0f;
    fallback.intercept = sweep_main_adc[0];
  }

  return fallback;
}

static bool is_noisy_pwm_duty_from_sweep(const float sweep_main_adc[MAX_SWEEP_POINTS],
                                         int points, int index) {
  if (index <= 0 || index >= points - 1) {
    return false;
  }

  const float expected_from_neighbors =
      (sweep_main_adc[index - 1] + sweep_main_adc[index + 1]) * 0.5f;
  const float dip = expected_from_neighbors - sweep_main_adc[index];
  const float required_dip =
      fmaxf(PWM_NOISE_MIN_DROP_ADC,
            expected_from_neighbors * PWM_NOISE_MIN_DROP_FRACTION);
  return dip >= required_dip;
}

static bool is_duty_in_noisy_pwm_band(uint16_t duty,
                                      const uint16_t sweep_duty[MAX_SWEEP_POINTS],
                                      const float sweep_main_adc[MAX_SWEEP_POINTS],
                                      int points) {
  for (int i = 1; i < points - 1; i++) {
    if (!is_noisy_pwm_duty_from_sweep(sweep_main_adc, points, i)) {
      continue;
    }

    const uint16_t distance = duty > sweep_duty[i] ? duty - sweep_duty[i]
                                                   : sweep_duty[i] - duty;
    if (distance <= PWM_NOISE_DUTY_GUARD) {
      return true;
    }
  }

