BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
  return false;
}

static int find_closest_sweep_index_to_target(
    const uint16_t sweep_duty[MAX_SWEEP_POINTS],
    const float sweep_main_adc[MAX_SWEEP_POINTS],
    int start_index,
    int end_index,
    float target_adc) {
  (void)sweep_duty;
  int best_index = start_index;
  float best_error = fabsf(sweep_main_adc[start_index] - target_adc);

  for (int i = start_index + 1; i <= end_index; i++) {
    const float current_error = fabsf(sweep_main_adc[i] - target_adc);
    if (current_error < best_error) {
      best_error = current_error;
      best_index = i;
    }
  }

  return best_index;
}

static bool pair_is_enabled(uint8_t active_channel) {
  return adc_inputs[active_channel].enabled &&
         tlc_output_for_pair[active_channel] != TLC_OUTPUT_DISABLED;
}

static CalibrationResult calibrate_one_pair(uint8_t active_channel) {
  uint16_t sweep_duty[MAX_SWEEP_POINTS];
  float sweep_main_adc[MAX_SWEEP_POINTS];
  float means[NUM_CHANNELS];
  int points = 0;
  uint16_t next_progress_duty = 0U;

  CalibrationResult result = {0};
  result.peak_adc = -1.0f;

  if (!pair_is_enabled(active_channel)) {
    for (uint32_t ch = 0U; ch < NUM_CHANNELS; ch++) {
      means[ch] = 0.0f;
    }

    status("pair disabled; leaving LED off and ADC at zero");
    write_calibration_sweep_row(active_channel, 0U, means);

    result.peak_adc = 0.0f;
    result.linear_start_adc = 0.0f;
    result.linear_end_adc = 0.0f;
    result.fit_r_squared = 0.0f;
    result.sweep_points = 1;
    write_calibration_summary_row(active_channel, &result);
    return result;
  }

  all_leds_off();
  delay_ms(BETWEEN_LED_MS);

  for (uint16_t duty = 0U;;) {
    if (duty >= next_progress_duty || duty == 0U || duty == PWM_MAX) {
      uart_write_str("STATUS: calibrating pair ");
      uart_write_u32((uint32_t)active_channel + 1U);
      uart_write_char('/');
      uart_write_u32(NUM_CHANNELS);
      uart_write_str(", pwm=");
      uart_write_u32(duty);
      uart_write_str("\r\n");

      const uint32_t next_duty = (uint32_t)duty + 8192U;
      next_progress_duty = next_duty > PWM_MAX ? PWM_MAX : (uint16_t)next_duty;
    }

    set_active_pair(active_channel, duty);
    measure_current_calibration_pwm_to_all_channels(CALIBRATION_REPEATS, means);
    write_calibration_sweep_row(active_channel, duty, means);

    sweep_duty[points] = duty;
    sweep_main_adc[points] = means[active_channel];
    points++;

    if (means[active_channel] > result.peak_adc) {
      result.peak_adc = means[active_channel];
      result.peak_duty = duty;
    }

    if (means[active_channel] >= ADC_LIMIT) {
      result.limit_reached = true;
      break;
    }

    if (duty == PWM_MAX || points >= (int)MAX_SWEEP_POINTS) {
      break;
    }

    const uint32_t next_duty = (uint32_t)duty + CALIBRATION_DUTY_STEP;
    duty = next_duty > PWM_MAX ? PWM_MAX : (uint16_t)next_duty;
  }

  all_leds_off();
  delay_ms(BETWEEN_LED_MS);

  LinearRangeFit fit = find_linear_range(sweep_duty, sweep_main_adc, points);
  result.linear_start_duty = sweep_duty[fit.start_index];
  result.linear_end_duty = sweep_duty[fit.end_index];
  result.linear_start_adc = (fit.slope * (float)result.linear_start_duty) + fit.intercept;
  result.linear_end_adc = (fit.slope * (float)result.linear_end_duty) + fit.intercept;
  result.fit_slope = fit.slope;
  result.fit_intercept = fit.intercept;
  result.fit_r_squared = fit.r_squared;
  result.fallback_fit = fit.fallback_used;
  result.sweep_points = points;

  float usable_max_adc = result.linear_end_adc;
  if (result.peak_adc > 0.0f &&
      (usable_max_adc <= 0.0f || usable_max_adc > result.peak_adc)) {
    usable_max_adc = result.peak_adc;
  }

  float selected_fraction = TRACKING_FRACTION_OF_MAX;
  int selected_index = find_closest_sweep_index_to_target(
      sweep_duty, sweep_main_adc, fit.start_index, fit.end_index,
      usable_max_adc * selected_fraction);

  for (float fraction = TRACKING_FRACTION_OF_MAX;
       fraction >= MIN_TRACKING_FRACTION_OF_MAX - 0.001f;
       fraction -= TRACKING_FRACTION_STEP) {
    const float target_adc = usable_max_adc * fraction;
    const int candidate_index = find_closest_sweep_index_to_target(
        sweep_duty, sweep_main_adc, fit.start_index, fit.end_index, target_adc);

    if (is_duty_in_noisy_pwm_band(sweep_duty[candidate_index],
                                  sweep_duty, sweep_main_adc, points)) {
      continue;
    }

    selected_fraction = fraction;
    selected_index = candidate_index;
    break;
  }

  if (is_duty_in_noisy_pwm_band(sweep_duty[selected_index],
                                sweep_duty, sweep_main_adc, points)) {
    for (int i = selected_index - 1; i >= fit.start_index; i--) {
      if (!is_duty_in_noisy_pwm_band(sweep_duty[i], sweep_duty,
                                     sweep_main_adc, points)) {
        selected_index = i;
        selected_fraction = usable_max_adc > 0.0f
                                ? sweep_main_adc[i] / usable_max_adc
                                : 0.0f;
        break;
      }
    }
  }

  result.target_adc = usable_max_adc * selected_fraction;
  result.tracking_duty = sweep_duty[selected_index];
  result.tracking_reference_adc = sweep_main_adc[selected_index];

  write_calibration_summary_row(active_channel, &result);
  return result;
}

static void run_calibration(void) {
  calibration_valid = false;
  calibration_loaded_mask = 0U;
  for (uint32_t channel = 0U; channel < NUM_CHANNELS; channel++) {
    uart_write_str("STATUS: calibrating pair ");
    uart_write_u32(channel + 1U);
    uart_write_char('/');
    uart_write_u32(NUM_CHANNELS);
    uart_write_str("\r\n");

    calibration[channel] = calibrate_one_pair((uint8_t)channel);

    uart_write_str("STATUS: calibration done on pair ");
    uart_write_u32(channel + 1U);
    uart_write_char('/');
    uart_write_u32(NUM_CHANNELS);
    uart_write_str(", tracking duty=");
    uart_write_u32(calibration[channel].tracking_duty);
    uart_write_str(", reference adc=");
    uart_write_float(calibration[channel].tracking_reference_adc, 2U);
    uart_write_str("\r\n");
  }
  calibration_valid = true;
  calibration_loaded_mask = (1UL << NUM_CHANNELS) - 1UL;
}

static void log_tracking_repeats(
    uint32_t timestamp_ms,
    uint32_t cycle,
    uint8_t active_channel,
    uint16_t duty,
    const uint16_t raw_samples[MAX_MEASUREMENT_REPEATS][NUM_CHANNELS]) {
  for (uint32_t repeat = 0U; repeat < TRACKING_REPEATS; repeat++) {
    write_tracking_repeats_row(timestamp_ms, cycle, active_channel, duty,
                               repeat, raw_samples[repeat]);
  }
}

static bool parse_u32_field(char **cursor, uint32_t *value) {
  char *end = NULL;
  const unsigned long parsed = strtoul(*cursor, &end, 10);
  if (end == *cursor) {
    return false;
  }

  *value = (uint32_t)parsed;
  *cursor = end;
  return true;
}

static bool consume_comma(char **cursor) {
  if (**cursor != ',') {
    return false;
  }

