BobTheBu006/Robot-Code/OD tests/stm32_g474re_tlc59711_sweep_main.c
  (*cursor)++;
  return true;
}

static void clear_host_calibration(void) {
  memset(calibration, 0, sizeof(calibration));
  calibration_valid = false;
  calibration_loaded_mask = 0U;
  status("command accepted: LOADZERO");
}

static void restore_calibration_row(char *payload) {
  uint32_t led_index = 0U;
  uint32_t tracking_duty = 0U;
  uint32_t reference_adc_centi = 0U;
  char *cursor = payload;

  if (!parse_u32_field(&cursor, &led_index) || !consume_comma(&cursor) ||
      !parse_u32_field(&cursor, &tracking_duty) || !consume_comma(&cursor) ||
      !parse_u32_field(&cursor, &reference_adc_centi) || *cursor != '\0') {
    status("invalid LOADROW command");
    return;
  }

  if (led_index >= NUM_CHANNELS || tracking_duty > PWM_MAX ||
      reference_adc_centi > 409500U) {
    status("invalid LOADROW value");
    return;
  }

  CalibrationResult *result = &calibration[led_index];
  memset(result, 0, sizeof(*result));
  result->peak_duty = (uint16_t)tracking_duty;
  result->peak_adc = (float)reference_adc_centi / 100.0f;
  result->target_adc = result->peak_adc;
  result->tracking_duty = (uint16_t)tracking_duty;
  result->tracking_reference_adc = result->peak_adc;
  result->sweep_points = 1;

  calibration_loaded_mask |= (1UL << led_index);
  if (calibration_loaded_mask == ((1UL << NUM_CHANNELS) - 1UL)) {
    calibration_valid = true;
    status("calibration restored from host CSV");
  }
}

static void complete_command(const char *command) {
  if (strcmp(command, "C") == 0 ||
      strcmp(command, "RESET_CALIBRATE") == 0 ||
      strcmp(command, "CALIBRATE") == 0 ||
      strcmp(command, "RUN_CALIBRATE") == 0) {
    requested_action = ACTION_CALIBRATE;
    status("command accepted: RESET_CALIBRATE");
  } else if (strcmp(command, "U") == 0 ||
             strcmp(command, "REUSE_CALIBRATION") == 0 ||
             strcmp(command, "RESTART") == 0 ||
             strcmp(command, "RUN_REUSE") == 0) {
    requested_action = ACTION_REUSE_CALIBRATION;
    status("command accepted: REUSE_CALIBRATION");
  } else if (strcmp(command, "STATUS") == 0) {
    uart_write_str("STATUS: calibration_valid=");
    uart_write_u32(calibration_valid ? 1U : 0U);
    uart_write_str(", restored_rows=");
    uart_write_u32(__builtin_popcount(calibration_loaded_mask));
    uart_write_str("\r\n");
  } else if (strcmp(command, "LOADZERO") == 0) {
    clear_host_calibration();
  } else if (strncmp(command, "LOADROW,", 8U) == 0) {
    restore_calibration_row((char *)command + 8U);
  } else if (strcmp(command, "BOARD_RESET") == 0) {
    status("command accepted: BOARD_RESET");
    all_leds_off();
    delay_ms(10U);
    NVIC_SystemReset();
  } else if (command[0] != '\0') {
    uart_write_str("STATUS: unknown command: ");
    uart_write_str(command);
    uart_write_str("\r\n");
  }
}

static void poll_commands(void) {
  char c;
  while (uart_read_char(&c)) {
    if (c == 'C' && command_length == 0U) {
      requested_action = ACTION_CALIBRATE;
      command_length = 0U;
      status("command accepted: RESET_CALIBRATE");
      continue;
    }

    if (c == 'U' && command_length == 0U) {
      requested_action = ACTION_REUSE_CALIBRATION;
      command_length = 0U;
      status("command accepted: REUSE_CALIBRATION");
      continue;
    }

    if (c == '\r') {
      continue;
    }

    if (c == '\n') {
      command_buffer[command_length] = '\0';
      complete_command(command_buffer);
      command_length = 0U;
      continue;
    }

    if (command_length + 1U < sizeof(command_buffer)) {
      command_buffer[command_length++] = c;
    } else {
      command_length = 0U;
      status("command buffer overflow");
    }
  }
}

static RequestedAction take_requested_action(void) {
  poll_commands();
  RequestedAction action = requested_action;
  requested_action = ACTION_NONE;
  return action;
}

static RequestedAction wait_for_action(void) {
  while (1) {
    RequestedAction action = take_requested_action();
    if (action != ACTION_NONE) {
      return action;
    }
  }
}

static RequestedAction run_tracking_until_command(void) {
  uint32_t cycle = 0U;
  float means[NUM_CHANNELS];
  uint16_t raw_samples[MAX_MEASUREMENT_REPEATS][NUM_CHANNELS];

  status("tracking started");
  while (1) {
    float temperature_c = NAN;
    float humidity_percent = NAN;
    uart_write_str("STATUS: tracking cycle ");
    uart_write_u32(cycle);
    uart_write_str("\r\n");

    (void)aht_read(&temperature_c, &humidity_percent);

    for (uint32_t channel = 0U; channel < NUM_CHANNELS; channel++) {
      RequestedAction action = take_requested_action();
      if (action != ACTION_NONE) {
        return action;
      }

      measure_pair_to_all_channels((uint8_t)channel,
                                   calibration[channel].tracking_duty,
                                   TRACKING_REPEATS, means, raw_samples);

      const uint32_t timestamp_ms = millis();
      log_tracking_repeats(timestamp_ms, cycle, (uint8_t)channel,
                           calibration[channel].tracking_duty, raw_samples);
      write_tracking_row(timestamp_ms, cycle, (uint8_t)channel, means,
                         temperature_c, humidity_percent);
    }

    cycle++;
    status("tracking cycle complete; waiting 120 seconds");
    const uint32_t wait_start = millis();
    while ((millis() - wait_start) < BETWEEN_TRACKING_CYCLES_MS) {
      RequestedAction action = take_requested_action();
      if (action != ACTION_NONE) {
        return action;
      }
      delay_ms(10U);
    }
  }
}

int main(void) {
  clock_init_hsi16();
  dwt_init();
  SysTick_Config(SYSCLK_HZ / 1000UL);
  gpio_init();
  usart2_init();
  status("boot: USART2 ready");
  status("boot: AHT init starting");
  aht_init();
  status("boot: AHT init done");
  status("boot: ADC init starting");
  adc_init_all();
  status("boot: ADC init done");
  status("boot: TLC off starting");
  all_leds_off();
  status("boot: TLC off done");

  status("STM32G474RE ready; waiting for RESET_CALIBRATE or REUSE_CALIBRATION");

  RequestedAction action = wait_for_action();
  while (1) {
    write_all_headers();

    if (action == ACTION_CALIBRATE) {
      status("measurement state reset; calibration starting at pair 0");
      run_calibration();
    } else if (action == ACTION_REUSE_CALIBRATION && !calibration_valid) {
      status("no RAM calibration available; calibration starting at pair 0");
      run_calibration();
    } else {
      status("reusing RAM calibration; tracking restarting at pair 0");
    }

    action = run_tracking_until_command();
  }
}
